product/api/performance.yml
config:
  target: http://localhost:4000
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  # Load & configure a couple of useful plugins
  # https://artillery.io/docs/reference/extensions
  plugins:
    ensure:
      thresholds:
        - http.response_time.p99: 100
        - http.response_time.p95: 75
    apdex:
      threshold: 100
    metrics-by-endpoint: {}
scenarios:
  - flow:
      - loop:
          - get:
              url: '/'
          - get:
              url: '/healthcheck'
          - get:
              url: '/api/@next/planning_applications'
          - get:
              url: '/api/@next/planning_applications/1'
        count: 100